[
 {
   "A": "​FURAMA HOTEL, RIVERFRONT",
   "B": "Havelock Rd, S169633",
   "C": "- Level 3 beside Kintamani Indonesian Restaurant",
   "E": 1.288046,
   "F": 103.83596
 },
 {
   "A": "​GARDENS BY THE BAY",
   "B": "Marina Gardens Dr, S018953",
   "C": "- Musollah is located next to Texas Chicken.",
   "E": 1.282034,
   "F": 103.867383
 },
 {
   "A": "ADELPHI",
   "B": "Coleman Street, S179803",
   "C": "- Level 3.  Look for “Exit” sign next to unit #03-09.  Enter exit door (Staircase 2) and enter another door and proceed straight.   Prayer place is located under the staircase.  Slippers are provided and for ablution, go to the toilet nearby.",
   "E": 1.291514,
   "F": 103.851023
 },
 {
   "A": "ADMIRALTY SECONDARY SCHOOL",
   "B": "Woodlands Crescent, S737916",
   "C": "– Level 3, outside AVA room (look for the back door).  Only for Zuhur prayers, Monday at 1.15 pm, Tuesday and Wednesday at 2.15 pm and Thursday at 2.20 pm.  For ablution, go to the toilet nearby.",
   "E": 1.446557,
   "F": 103.802651
 },
 {
   "A": "﻿AL-AZHAR RESTAURANT",
   "B": "Cheong Chin Nam Road, S599736",
   "C": "- Musollah is located in the restaurant for staff and customers. Prayer mat is provided. Ablution can be done in the toilet nearby.",
   "E": 1.343239,
   "F": 103.775129
 },
 {
   "A": "ANSON HOUSE",
   "B": "Anson Road, S079911",
   "C": "- Level 4, carpark.  A small prayer place located at the extreme end.  For ablution, walk down the metal staircase.",
   "E": 1.27427,
   "F": 103.844443
 },
 {
   "A": "AXA TOWER",
   "B": "Shenton Way, S06881",
   "C": "- Musollah is located at B3.\\nTake lift to B2 and take car park lift to B3. Walk along VIP section and you will see Prayer Room next to some fuse box stations. \\nIt's called Surau Temasek. It is near Staircase 5 at the VIP Yellow Zone area of carpark. All amenities provided.\\nWudhu can be done at nearby toilet and Muslimah area also available.​",
   "E": 1.276462,
   "F": 103.847408
 },
 {
   "A": "BADOQUE",
   "B": "246 Upper Thomson Rd, S574370",
   "C": "- Inside the cafe, beside the toilet. They only provide sajadah but not sure about telekong. Space is enough for one person at a time.",
   "E": 1.354,
   "F": 103.834465
 },
 {
   "A": "BESTWAY BUILDING",
   "B": "Prince Edward Road, S079212",
   "C": "– Nearest mosque is Masjid Haji Muhammed Salleh (Palmer Road, S079424), about 5 minutes walk.",
   "E": 1.274339,
   "F": 103.848255
 },
 {
   "A": "BIG BOX, BESIDE JEM",
   "B": "Venture Ave, S608521",
   "C": "- From JEM (M&S), use the linkway top get to Big Box. Take the escalator on your right. Go all the way down till you see a door. When you exit from the escalator, you will see a carpark. Walk towards the green downhill thingy and you will see a sign that says Musollah. Walk towards it, you will see a corridor where the Musollah is located. Males on the left side and females on the right side.",
   "E": 1.332196,
   "F": 103.744719
 },
 {
   "A": "BISHAN STADIUM",
   "B": "Bishan Street 14, S579784",
   "C": "– Located on the ground level in the equipment room near to the starting point.  Sejadah and telekong available.  For ablution, go to the toilet nearby.",
   "E": 1.354711,
   "F": 103.851535
 },
 {
   "A": "BUKIT BATOK DRIVING CENTRE",
   "B": "Bukit Batok West Avenue 5, S659085",
   "C": "– Surau is on Level 3, staircase landing at exit door next to fire hose reel.  Open a blue door with a signage stating “Staircase 3”.  Slippers, sejadah and telekung are provided.  For ablution, go to the toilet nearby.",
   "E": 1.367178,
   "F": 103.750209
 },
 {
   "A": "BUKIT PANJANG PLAZA",
   "B": "Jelebu Road, S677743",
   "C": "- At 4th level, next to Daiso, there is a door that leads to the staircase. Prayer rugs available, but you have to bring your own telekung. Wudhu can be taken at the nearby toilet.",
   "E": 1.380548,
   "F": 103.764321
 },
 {
   "A": "BULKHAUL HOUSE",
   "B": "Beach Road, S169688",
   "C": "- Surau available at 67 Beach Road\\n#02-02; inside Vivafit Gym.\\nFor females only.\\nWashroom & wudhu place available.\\nSejadah and telekung provided. Please ask for permission by the Vivafit Gym staff.",
   "E": 1.297265,
   "F": 103.85638
 },
 {
   "A": "CAFEELA SEAFOOD RESTAURANT",
   "B": "Jalan Kayu, S799481",
   "C": "- Musollah located on the second floor of Cafeela Restaurant. The entrance of this Musollah is by the staircase with the metal gate, just walk up and you will reach the place.\\nPrayer mats and telekung are provided.",
   "E": 1.397983,
   "F": 103.873269
 },
 {
   "A": "CAUSEWAY POINT SHOPPING CENTRE",
   "B": "Woodlands Square, S738099",
   "C": "-  Level 7 staircase landing of cargo lift.  The cargo lift is situated near to the cinema toilet.  There are signs to lead to the area.  For ablution, go to the nearby toilet.",
   "E": 1.435875,
   "F": 103.785474
 },
 {
   "A": "CHANGI AIRPORT CARGO COMPLEX",
   "B": "Airport Cargo Road, S819456",
   "C": "– In CIAS CargoHub.  No telekong and ablution place outside the room.",
   "E": 1.377013,
   "F": 103.99715
 },
 {
   "A": "CHANGI AIRPORT TERMINAL 1",
   "B": "Airport Boulevard, S819642",
   "C": "- Level 1 transit area, below gate holdroom C1 at Arrival Hall West.  The male and female section are separated by a curtain.  Common ablution area for males and females.  It is a multi-religious prayer room.",
   "E": 1.36115,
   "F": 103.990112
 },
 {
   "A": "CHANGI AIRPORT TERMINAL 2",
   "B": "Airport Boulevard, S819643",
   "C": "- Level 2 transit area, at Departure Transit Lounge North.  It is a multi-religious prayer room.",
   "E": 1.355343,
   "F": 103.988337
 },
 {
   "A": "CHANGI AIRPORT TERMINAL 3",
   "B": "Airport Boulevard, S819663",
   "C": "- Level 2 transit area, at Departure Transit Lounge North.  It is a multi-religious prayer room.",
   "E": 1.357006,
   "F": 103.986478
 },
 {
   "A": "CHANGI FERRY POINT TERMINAL",
   "B": "51 Lor Bekukong, 499172",
   "C": "- Surau is available at the nearby Tang Tea House.",
   "E": 1.390945,
   "F": 103.987594
 },
 {
   "A": "CHANGI GENERAL HOSPITAL",
   "B": "Simei Street 3, S529889",
   "C": "- Musollah is opposite the Kopitiam and near the Mr Bean outlet. Prayer mats and telekungs are available for use.",
   "E": 1.340705,
   "F": 103.949526
 },
 {
   "A": "CHANGI VILLAGE",
   "B": "Changi Village Rd, S509926",
   "C": "- Briyani Bagus restaurant at Blk 5 Changi Village 01-2039.\\nThe shop is located opposite the zebra crossing.\\nThe prayer room can be used for public and customers. Telekong & prayer mats provided.\\n- Rasa Rasa restaurant has a surau available in the middle of the restaurant. Telekung and prayer mats are provided. Wudhu to be taken at the nearby toilet",
   "E": 1.384839,
   "F": 103.987399
 },
 {
   "A": "CHANGI VILLAGE HOTEL",
   "B": "Netheravon Rd, 508502",
   "C": "- For Saltwater customers, Prayer room is not available in the restaurant, but they have defined space for prayers next to the restaurant, and subject to availability upon request.",
   "E": 1.390492,
   "F": 103.985978
 },
 {
   "A": "CHARCOS THE FLAMING CHICKEN",
   "B": "Ang Mo Kio Ave 5, S560608",
   "C": "- A comfortable musollah provided for both men/women.​",
   "E": 1.378743,
   "F": 103.836967
 },
 {
   "A": "CITY PLAZA",
   "B": "Geylang Rd, S409286",
   "C": "- Just beside Arnold's Chicken eatery, there's a makeshift prayer place set by a guard-uncle .",
   "E": 1.314796,
   "F": 103.893403
 },
 {
   "A": "CLIFFORD CENTRE",
   "B": "Raffles Place, S048621",
   "C": "– Level 5, carpark at corner.  Use carpark lift beside escalator behind Fuji Film shop. The room is air-conditioned and partitioned for men and women. Ablution place is just outside the room.",
   "E": 1.28383,
   "F": 103.852389
 },
 {
   "A": "COMFORTDELGRO DRIVING CENTRE",
   "B": "205 Ubi Ave 4, Singapore 408805",
   "C": "- Go to the Motorcycle Training Reporting Counter\" near to the main entrance. Enter the door unit number 01-06. Inside is the room with segregated space for men and women. For ablution",
   "E": 1.335797,
   "F": 103.896683
 },
 {
   "A": "COMFORTDELGRO DRIVING CENTRE",
   "B": "Ubi Avenue 4, S408805",
   "C": "– Go to the “Motorcycle Training Reporting Counter” near the main entrance.  Enter the door unit number 01-06.  Inside, there is a prayer room with segregated space for men and women.  \\nFor ablution, take the tap wrench hanging at the door. Go out of the room, turn left and left again. There should be a tap along the walkway where the cyclists hang their training number tag.  Slippers are provided outside the room.",
   "E": 1.335744,
   "F": 103.896683
 },
 {
   "A": "CYCLE & CARRIAGE – Mitsubishi Showroom",
   "B": "Alexandra  Road, S159931",
   "C": "– Level 2.  Take the lift from then main lobby.  Upon exiting, turn left and proceed straight to the car washing bay and locate the “M&E Room”.  Proceed inside and there is a separate cubicle for males and females.  Slippers are provided and the ablution place is nearby.",
   "E": 1.291652,
   "F": 103.813361
 },
 {
   "A": "DARUL ARQAM SINGAPORE",
   "B": "Onan Road, S424484",
   "C": "– Musollah is on Level 2.  With ablution place and segregated space for males and females.",
   "E": 1.315662,
   "F": 103.896852
 },
 {
   "A": "DAYS HOTEL SINGAPORE",
   "B": "Jalan Rajah, S329133",
   "C": "- Prayer room at level 4, room number 431. Key card, ask from staff.",
   "E": 1.326975,
   "F": 103.847538
 },
 {
   "A": "DBS TOWER 1, Behind CPF Building",
   "B": "Shenton Way, S068809",
   "C": " - Basement 1, carpark.  Turn right on entering carpark. Towards the end, there are 2 rooms next to driver's resting area.  For ablution, go one level down, there are 2 male toilets and for females, use the left one and place a signboard for female.  Slippers and telekong available.",
   "E": 1.277827,
   "F": 103.84895
 },
 {
   "A": "DOWNTOWN EAST",
   "B": "Pasir Ris Close, S519599",
   "C": "- Musollah is in the D'Resort Building, Level 1. Small ablution place and shared prayer room for males and females available. Prayer mats provided. \\n- Sakura International Buffet Restaurant: There is a small room marked “Surau” near to the restroom with a convenient ablution place inside.",
   "E": 1.376371,
   "F": 103.954881
 },
 {
   "A": "EAST VILLAGE MALL",
   "B": "430 Upper Changi Rd, S487048",
   "C": "- A quiet corner for prayer @East Village Mall\\n1. Find the exit door next to the lift lobby near unit #01-56.\\n2. Turn left after exiting the door.\\n3. There are a few pairs of slippers for ablution (the nearest toilet will be next to unit #01-53)\\n- Maqayla opens up their storage room as a prayer area \\n- Fineline Bistro & Satay Grill also has a prayer area (only for customers)\\n- Tang Tea also has a prayer room (only for customers)",
   "E": 1.331851,
   "F": 103.946317
 },
 {
   "A": "ELIAS MALL",
   "B": "Elias Rd, S510685",
   "C": "- Musollah is located at Blk 624A carpark, shared for both female and male. Prayer mat provided. No telekong provided. Wudhu can be taken at the nearby toilet beside the handphone shop.",
   "E": 1.378355,
   "F": 103.941883
 },
 {
   "A": "ENVIRONMENT BUILDING",
   "B": "Scotts Road, S228231",
   "C": "– Level 25.  Take visitor’s pass at visitor’s lobby (West Wing Lobby).  At level 25, take stairs to level 26 and enter door.\\n- Musollah at level 26. \\nSeparate wudhu area for men and women.To go to musollah, take the visitor's pass at the visitor's lobby (West wing lobby).Take lift to level 25 (highest level lift can go).Then take stairs to level 26 and open the musollah door.",
   "E": 1.310444,
   "F": 103.836361
 },
 {
   "A": "FAIRMONT HOTEL SINGAPORE",
   "B": "Bras Basah Rd, S189560",
   "C": "- The prayer room is located on the left side of the corridor passage outside the Asian Market Cafe at Level 2 Fairmont Hotel. Ablution at the toilet and prayer garment is provided. A separate prayer room for males is available across a narrow hall next to ladies.",
   "E": 1.294102,
   "F": 103.853719
 },
 {
   "A": "FURAMA CITY CENTRE",
   "B": "Eu Tong Sen Street, S059804",
   "C": "– Lobby level, just beside the toilet and Tiffany Cafe and Restaurant.  Request the staff from the reception area to unlock the room.  They provide telekong for muslimah and there is a convenient ablution place inside the room.",
   "E": 1.2864,
   "F": 103.844761
 },
 {
   "A": "GARDENS BY THE BAY",
   "B": "Marina Gardens Dr, S018953",
   "C": "- Mussollah is located next to Texas Chicken.",
   "E": 1.281765,
   "F": 103.867394
 },
 {
   "A": "GERMAN CENTRE",
   "B": "International Business Park, S248646",
   "C": "– Basement carpark next to motorcycle parking lot (security restroom).  If the room is locked, look for security staff at information counter.  For ablution, go outside the room.",
   "E": 1.324792,
   "F": 103.746502
 },
 {
   "A": "GEYLANG SERAI MARKET",
   "B": "Geylang Serai, S402001",
   "C": "- Musollah in Malay Village \\n- Toko Warisan (Level 2), use a nearby toilet to take wudhu",
   "E": 1.316739,
   "F": 103.898277
 },
 {
   "A": "GHIM MOH ROAD",
   "B": "Ghim Moh Road, S270002",
   "C": "– Block 2,  void deck.  The last void deck surau (Surau Ghim Moh) in Singapore, founded by the late Ustaz Munawir Bin Mohd Dzafir who passed away on 7 January 1987. Fully equipped facilities with convenient ablution place.",
   "E": 1.312448,
   "F": 103.787135
 },
 {
   "A": "GLENEAGLES HOSPITAL",
   "B": "Napier Road, S258500",
   "C": "- Level 1.  Enter main entrance and turn right towards the toilet.  Just before the toilet, there is a staircase along the corridor and enter it where the prayer place is located.",
   "E": 1.307417,
   "F": 103.820034
 },
 {
   "A": "GLENEAGLES HOSPITAL",
   "B": "Napier Road, S258500",
   "C": "- Level 1.  Enter main entrance and turn right towards the toilet.  Just before the toilet, there is a staircase along the corridor and enter, the prayer place is located there.",
   "E": 1.307728,
   "F": 103.820034
 },
 {
   "A": "GOLDEN SHOE CAR PARK AND MARKET STREET FOOD CENTRE",
   "B": "Market Street, S048940",
   "C": "- Nearest mosque is Masjid Moulana Mohammad Ali (Raffles Place), about 5 minutes walk.",
   "E": 1.28426,
   "F": 103.850315
 },
 {
   "A": "GOODWOOD PARK HOTEL",
   "B": "Scotts Road, S228221",
   "C": "- Level B1, carpentry/engineering workshop.  Walk to valet parking booth, there is a door leading to steps going down to B1.  For ablution, go upstairs near vehicle washing bay/rear entrance of Gordon Grill kitchen.",
   "E": 1.308463,
   "F": 103.834569
 },
 {
   "A": "GRAND HYATT SINGAPORE",
   "B": "Scotts Road, S228211",
   "C": "- Level 1, carpark (same level as Straits Kitchen). Go to the left of Straits Kitchen and turn right. There is a convenient washroom for ablution. Room for prayer is located next to it. They provide telekong for muslimah. Please ask staff for assistance.",
   "E": 1.306528,
   "F": 103.833014
 },
 {
   "A": "GRANDLINK SQUARE",
   "B": "Guillemard Rd, S399690",
   "C": "- The Prayer room is located at Chill By The Bay Cafe",
   "E": 1.314211,
   "F": 103.891472
 },
 {
   "A": "HARBOURFRONT CENTRE",
   "B": "Maritime Square, S099253",
   "C": "–Nearest mosque is Masjid Temenggong Daeng Ibrahim (Telok Blangah Road, S098827), about 10 minutes walk.",
   "E": 1.264611,
   "F": 103.820324
 },
 {
   "A": "HAW PAR TECHNOCENTRE",
   "B": "Commonwealth Drive, S149598",
   "C": "- Basement carpark.  There is a carpeted area for praying. For ablution go to the toilet on the 1st floor.",
   "E": 1.303196,
   "F": 103.79669
 },
 {
   "A": "HEIRAZ",
   "B": "Changi Road, S419718",
   "C": "- There is a musollah for staff and for patrons to pray. Please ask staff for assistance.",
   "E": 1.316614,
   "F": 103.899136
 },
 {
   "A": "HONG LEONG BUILDING, next to Lau Pat Sat",
   "B": "Raffles Quay, S048581",
   "C": "– Level 5 & 7.  Take lift from main lobby and go towards car park.  Toilet on the lift level.  Prayer place is at corner and ablution place is nearby. If lost, you can get help from any of the Malay drivers there.",
   "E": 1.281431,
   "F": 103.850976
 },
 {
   "A": "IKEA ALEXANDRA",
   "B": "Alexandra Road, S159965",
   "C": "– Basement carpark, underneath the escalator near to carpark lot number 250.  Look out for a white door with the words “Male’s Prayer Room”.  An ablution place and segregated space for males and females are provided.",
   "E": 1.287964,
   "F": 103.806049
 },
 {
   "A": "IKEA TAMPINES",
   "B": "Tampines North Drive 2, S528764",
   "C": "- Level 4, near the toilet at extreme end of IKEA Restaurant & Cafe.  There are few signages that lead you to the location.  Separate rooms for male and female with convenient ablution place inside the room.",
   "E": 1.3745,
   "F": 103.932
 },
 {
   "A": "IMM BUILDING",
   "B": "Jurong East Street 21, S609601",
   "C": "– Lift lobby A, level 4. \\nYou will see the sign as you turn left towards the Staff Cafeteria. You will need a key for the ablution room. The key is located in the room. The prayer room is shared between Muslimin and Muslimah.",
   "E": 1.33479,
   "F": 103.746553
 },
 {
   "A": "INTERNATIONAL PLAZA",
   "B": "Anson Road, S079903",
   "C": "- Level 7, car park.  Take carpark lift 19 and 20 near to the Watsons store.  When you reach a small cornered area, turn into the prayer place.  No telekong provided and the toilet is on the level 6 & 8 for ablution.  Easier to use the staircase.",
   "E": 1.275829,
   "F": 103.845788
 },
 {
   "A": "INTERNATIONAL PLAZA",
   "B": "Anson Road, S079903",
   "C": "- Level 7, car park.  Take carpark lift 19 and 20 near to the Watsons store.  When you reach a small cornered area, turn into the prayer place.  No telekong provided and the toilet is on the level 6 & 8 for ablution.  Easier to use the staircase.",
   "E": 1.275721,
   "F": 103.845799
 },
 {
   "A": "ITE COLLEGE CENTRAL",
   "B": "Ang Mo Kio Drive, S567720",
   "C": "- Mussollahs can be found at the following areas.\\n1. Level 1 of Block H\\n2. Carpark of Block E.",
   "E": 1.377594,
   "F": 103.856381
 },
 {
   "A": "ITE COLLEGE WEST",
   "B": "Choa Chu Kang Grove, S688236",
   "C": "- Musollah is located at Block 1 level 1 at both staircase area.\\nAlternative site is at Blk 6 level 1. Take the main lift to level 1. Turn left and walk along a short corridor. After which, turn left again and you'll see a grey door for stairway. Open it and the musollah is right in front. Sejadah, telekong are provided.",
   "E": 1.375037,
   "F": 103.751794
 },
 {
   "A": "JAMES COOK UNIVERSITY, JCU",
   "B": "Sims Drive, S387380",
   "C": "- Separate male and female prayer room available for students. Please ask staff for assistance. \\n​\\nJOO CHIAT COMPLEX (1 Joo Chiat Rd, S420001)\\n- Toko Warisan Boutique (Level 2). There are 2 separate prayer rooms near to the entrance, just behind the display case with korma. Wudhu to be taken at the toilet nearby. Prayer mat is provided.\\nor \\nToko Warisan Book Store (#02-1013). There are 2 separate prayer rooms at the end of the bookstore, just past all the book shelves. Wudhu to be taken at the toilet nearby. Prayer mat is provided.",
   "E": 1.315916,
   "F": 103.875964
 },
 {
   "A": "J'S WOK & GRILL",
   "B": "Bedok Central, S460219",
   "C": "- Prayer room available for customers. It is a shared prayer room for males and females. Just walk towards the washroom, prayer room is on the left side. Sejadah and telekong available.",
   "E": 1.32543,
   "F": 103.932844
 },
 {
   "A": "JURONG POINT",
   "B": "Jurong West Central 2, S648886",
   "C": "- Take the travelator in front of Eu Yan Sang down to B2 and turn left. The surau is exactly under the travelator next to the carpark. Usually muslimin and muslimah need to take turns to use the surau. Please note that this surau is not open to public.",
   "E": 1.33937,
   "F": 103.705403
 },
 {
   "A": "KALLANG WAVE MALL",
   "B": "Stadium Place, S397628",
   "C": "- Surau is located at the toilet exit near to NTUC Fairprice Xtra. There is an ATM beside it. Just walk in the direction to the toilet. There is no longer a sign to indicate the prayer room. The prayer corner is believed to be shared by both males and females. Ablution can be done in the nearby toilets.",
   "E": 1.303248,
   "F": 103.872852
 },
 {
   "A": "KEPPEL BAY TOWER",
   "B": "Harbourfront Avenue, S098632",
   "C": "- Prayer corner is at Keppel Bay Tower Harbourfront, B1 Carpark. You will need to take the escalator down.",
   "E": 1.264932,
   "F": 103.818253
 },
 {
   "A": "KHOO TECK PUAT HOSPITAL",
   "B": "Yishun Central, S768828",
   "C": "- It is on level 5 to 10, Tower B. When you exit the lift, it is on the left, waiting area. Please note that it is not an official prayer room but it is just a place that can be used to perform your prayers according to the staff that put up the qiblat sign. Most likely, you will have to bring your own sejadah and ablution can be done in the nearby toilet(s).",
   "E": 1.424051,
   "F": 103.838656
 },
 {
   "A": "KHOO TECK PUAT HOSPITAL",
   "B": "Yishun Central, S768828",
   "C": "- It is on level 5 to 10, Tower B. When you exit the lift, it is on the left, waiting area. Please note that it is not an official prayer room but it is just a place that can be used to perform your prayers according to the staff that put up the qiblat sign. Most likely, you will have to bring your own sejadah and ablution can be done in the nearby toilet(s).",
   "E": 1.424051,
   "F": 103.838656
 },
 {
   "A": "KHOO TECK PUAT HOSPITAL",
   "B": "Yishun Central, S768828",
   "C": "- It is on level 5 to 10, Tower B. When you exit the lift, it is on the left, waiting area. Please note that it is not an official prayer room but it is just a place that can be used to perform your prayers according to the staff that put up the qiblat sign. Most likely, you will have to bring your own sejadah and ablution can be done in the nearby toilet(s).",
   "E": 1.424051,
   "F": 103.838656
 },
 {
   "A": "﻿KIDZANIA SENTOSA",
   "B": "31 Beach View, S098008",
   "C": "- Surau is for restaurant patrons only. Located at the 2nd level of Kidzania area. Only paying guest is able to use the prayer room. For parents with prams, elderly or disabled person, there’s a lift near the KFC establishment at level Turn right upon exiting the lift & go straight. Locate the LifeBuoy establishment. There will be a sign indicating the direction of the restroom & prayer room. The prayer rooms are located just across the restroom. Prayer mats, sejadah are available in the prayer room. Place for ablution also provided in the prayer room.",
   "E": 1.251323,
   "F": 103.820101
 },
 {
   "A": "KK WOMEN’S AND CHILDREN’S HOSPITAL",
   "B": "Bukit Timah Road, S229899",
   "C": "- Basement 1, Women's Tower. At a staircase landing after entering a door just left of the Women’s 24-Hour Clinic.   Slippers, sejadah and telekong are available. For ablution, go to the toilet nearby.",
   "E": 1.310625,
   "F": 103.846865
 },
 {
   "A": "KK WOMEN’S AND CHILDREN’S HOSPITAL",
   "B": "Bukit Timah Road, S229899",
   "C": "- Musollah is located on Basement 1, Women's Tower. At a staircase landing after entering a door just left of the Women’s 24-Hour Clinic.   Slippers, sejadah and telekong are available. For ablution, go to the toilet nearby.",
   "E": 1.310625,
   "F": 103.846865
 },
 {
   "A": "KUBLAI KHAN INTERNATIONAL & MONGOLIAN BBQ @ PARK MALL",
   "B": "Penang Rd, S238459",
   "C": "- Surau is available, just ask the staff but we are not sure whether it is only for customers.",
   "E": 1.289549,
   "F": 103.847361
 },
 {
   "A": "KUCINA ITALIAN RESTAURANT @ ONE KM",
   "B": "Tanjong Katong Road, S437157",
   "C": "- Prayer room provided for staff and patrons. Please ask staff for assistance.",
   "E": 1.314469,
   "F": 103.894635
 },
 {
   "A": "LAGUN SARI@JOO CHIAT",
   "B": "Joo Chiat Road, S427621",
   "C": "-   Level 5.  Take the lift to level 4, turn left and enter stair A exit door.  Go up to level 5 and turn left and proceed straight to the extreme end where the musollah is located.  There are few signs that lead to the location.  For ablution, go to the toilet nearby.",
   "E": 1.307957,
   "F": 103.90365
 },
 {
   "A": "LASALLE COLLEGE OF THE ARTS",
   "B": "McNally Street, S187940",
   "C": "- Musollah is located at the corners of basement carpark. For muslimah, there is a room near motorcycle parking lot, for muslimins, it is at the opposite corner. Prayer mat, telekong provided. Ablution can be done at the nearest toilet.",
   "E": 1.302952,
   "F": 103.851659
 },
 {
   "A": "LIFELONG LEARNING INSTITUTE",
   "B": "Eunos Road 8, S408601",
   "C": "- Musollah for Muslimin is located next to the Goods Lift, Basement 1 (Lift Lobby B).\\n- Musollah for Muslimah is located at Level 2 (Lift Lobby B). Exit the passenger lift, you will pass a feature wall on the left, the entrance to a lecture theatre and then you will see a door leading to Stair 3\". Enter that door and you'll see another door. The 2nd door will lead to the landing where the prayer area is.\"",
   "E": 1.319772,
   "F": 103.892346
 },
 {
   "A": "LUCKY PLAZA",
   "B": "Orchard Road, S238863",
   "C": "- Surau is located on level 8 car park, accessible via cargo lift.",
   "E": 1.304554,
   "F": 103.83408
 },
 {
   "A": "MARINA BAY FINANCIAL CENTRE TOWER 1",
   "B": "Marine Blvd, S018981",
   "C": "- Mussollah is located on Level 21 of Tower 1, which is available via access pass (which you can get from the reception from level 1). \\nOnce you leave the lift at level 21, walk to the carpeted area and turn left, walk past the mail room and turn left again. There are separate rooms for muslim and muslimah and each room is fully equiped with sejadah, kain and taps in the room as well. This room is only for staff.",
   "E": 1.280425,
   "F": 103.854196
 },
 {
   "A": "MARINA MANDARIN HOTEL",
   "B": "6 Raffles Boulevard,  S039594",
   "C": "- Surau is available for Aquamarine guests. Sejadah and telekung provided. Please ask staff for assistance.",
   "E": 1.291831,
   "F": 103.857151
 },
 {
   "A": "MARINA SQUARE",
   "B": "Raffles Boulevard, S039594",
   "C": "- The prayer room is located at Carpark Basement 1 (Small partition room).\\n1. If you are just outside the building, look for Qiqi restaurant and take the escalator, on its right, down to B1 car park\\n2. Alternatively, if u are inside the building, orientate yourself by standing between coffee bean cafe and manhattan fish restaurant. There is an escalator in between. Take the escalator down to B1 carpark.\\n3. You should find yourself in the Green zone area of the Carpark. Look for lot 67. The musollah is a stone throw away.\\n4. The prayer room has space for both males and females. For ablution, go to the toilet on level 1 for females on level B1 for males.",
   "E": 1.291026,
   "F": 103.857036
 },
 {
   "A": "MEDIACORP CAMPUS",
   "B": "Stars Avenue, S138507",
   "C": "- Equinix Building. West side 3rd floor. \\nMusollah is just by the mid stairways in between level 3 & 4. \\nSejadah is provided and also there is an arrow sign on the ceiling indicating the qiblat direction.",
   "E": 1.295362,
   "F": 103.792284
 },
 {
   "A": "MOUNT ALVERNIA HOSPITAL",
   "B": "Thomson Road, S574623",
   "C": "- Opposite the registration counter,  a small room called 'Quiet Room' specially reserved for Muslims to do their prayers. Please ask Muslim staff for assistance.",
   "E": 1.341773,
   "F": 103.837825
 },
 {
   "A": "MOUNT ELIZABETH NOVENA HOSPITAL",
   "B": "Irrawaddy Rd, S329563",
   "C": "- Musollah is located at the hospital lobby near to Guardian Pharmacy or after Starbucks Coffee. There is a Muslimin and Muslimah prayer room, ablution tap and slippers available in the room. Telekun, sejadah and al-quran is available.",
   "E": 1.322158,
   "F": 103.8442
 },
 {
   "A": "NANYANG POLYTECHNIC",
   "B": "Ang Mo Kio Avenue 8, S569830",
   "C": "- Block A Level 1 staircase, in front of security guards’ room.\\n- Block E Level 5 staircase.  There are 2 staircases and not the one in front of Student Development Office.  There is no lift access to level 5, take staircase from level 4.  \\n- Block P Level 8 staircase.  There are 2 staircases and both have prayer place.  No lifts access to level 8, take staircase from level 7.",
   "E": 1.378697,
   "F": 103.849345
 },
 {
   "A": "NANYANG TECHNOLOGICAL UNIVERSITY",
   "B": "Nanyang Avenue, S639798",
   "C": "Male \\nSouth Spine S1, level B5 (take fireman lift to B5)\\n- Go to the Electronic & Electrical Engineering at level B3. To straight and pass by Luminous lab. Take the Fireman's lift down to Level B5. Exit lift and turn right. The prayer room is on the left side. \\nSouth Spine, SPMS, Level 2 (beside LT1)\\n- School of Physical and Mathematical Sciences (SPMS). Find for SPMS-LT1. Prayer room is just to the right of the lecture theatre.\\nNorth Spine N1, School of CEE, B3 (near bus stop)\\nNorth Spine N2, Level 2 (rooftop)\\n- Situated at Block N2, Level 2 near lift NS2-2. Turn right after exit from the lift. Then turn left to the sheltered alley. It's on the right side.\\nNorth Spine N4 School of CE, B2 (under staircase)\\nFemale\\nSouth Spine S3, Level 2 (rooftop)\\n- Go to the Electronic & Electrical Engineering at level B3. Use the Passenger Lift from AHU Room S3.\\nSouth Spine, SPMS, Level 2 (beside LT1)\\n- School of Physical and Mathematical Sciences (SPMS). Find for SPMS-LT1. Prayer room is just to the right of the lecture theatre.\\nNorth Spine N3, Level 3 (rooftop)\\nNorth Spine N3, Level B2 AHU Room\\nNIE between Block 2 and 3 (near Carpark 2)\\nNIE between Block 2 and 3 (near Carpark 2)",
   "E": 1.348349,
   "F": 103.683171
 },
 {
   "A": "NATIONAL COMMUNITY LEADERSHIP INSTITUTE, NACLI",
   "B": "South Bouna Vista Road, S118176",
   "C": "– Nearest mosque is Masjid Ahmad (Lorong Sarhad, S119173), about 5 minutes walk.",
   "E": 1.283491,
   "F": 103.788697
 },
 {
   "A": "NATIONAL UNIVERSITY HOSPITAL",
   "B": "Lower Kent Ridge Road, S119074",
   "C": "- Main building, Level 6, 06-70 Quiet Room, next to Patient Service Centre 6.  Telekong and prayer mat provided and with ablution place.\\n- NUH Medical Centre, Level 10, Corridor F. Look for 'Prayer Room'.",
   "E": 1.295121,
   "F": 103.783316
 },
 {
   "A": "NATIONAL UNIVERSITY HOSPITAL",
   "B": "Lower Kent Ridge Road, S119074",
   "C": "- Main building, Level 6, 06-70 Quiet Room, next to Patient Service Centre 6.  Telekong and prayer mat provided and with ablution place.\\n- Musollah is situated at the Emergency Ward near the Emergency Entrance. Turn to the RIGHT and go up the staircase. For Muslimin, proceed to the 3rd floor. For Muslimah, proceed to the 4th floor. Ask any Muslim lady working at the front counter for assistance. Prayer mats are provided but not telekong. Ablution: use the washroom on the ground floor of the Emergency Ward.\\n- Musollah is situated at NUH Medical Centre. Level 8 National University Cancer Centre. Enter the rooms behind the reception/registration counter. The prayer room is located at the end of the stretch (near lifts). Very comfortable musollah. Prayer mats and telekungs available. Ablution: use the washroom at the same level.",
   "E": 1.295121,
   "F": 103.783316
 },
 {
   "A": "NEW TECH PARK",
   "B": "151 Lorong Chuan, S556741",
   "C": "- Surau is on 1st floor Lobby F. You can try to ask for help from muslim security guards.",
   "E": 1.352105,
   "F": 103.860695
 },
 {
   "A": "NEX",
   "B": "23 Serangoon Central, S556083",
   "C": "- This is an unofficial surau to pray at NEX shopping centre.\\nGo to level 4r (rooftop). Find the goods lift lobby near to the library. Find the emergency staircase. Once you go inside it, there would be an arrow pointing the kiblah. \\nYou need to bring your own prayer garments and sejadah.",
   "E": 1.350761,
   "F": 103.872256
 },
 {
   "A": "NG TENG FONG GENERAL HOSPITAL",
   "B": "Jurong East Street 21, S609606",
   "C": "– Level 4, Tower B.  Near the Visitor Lounge 1, there is a room called 'Quiet Room'.  Sejadah and telekong available. The room is not easily accessible to public as it is meant for registered visitors to the hospital.",
   "E": 1.333379,
   "F": 103.74557
 },
 {
   "A": "NGEE ANN POLYTECHNIC",
   "B": "Clementi Rd, S599489",
   "C": "- Musollahs are listed here:\\n- Blk 40 Level 6 staircase\\n- HMS Level 6\\n- Blk 50 Level 4\\n- Blk 37 Level 6 staircase\\n- Stadium Blk 18 Level 3\\n- Convention Centre level 1 near entrance.",
   "E": 1.332916,
   "F": 103.777558
 },
 {
   "A": "NOL BUILDING",
   "B": "Alexandra Road, S119962",
   "C": "- Level 3, carpark.  Go through a door that states “Music Lounge”.  Once out, turn left for the prayer place and turn right for ablution place.",
   "E": 1.275333,
   "F": 103.801461
 },
 {
   "A": "NORTHPOINT SHOPPING CENTRE",
   "B": "Yishun Ave 2, S769098",
   "C": "- To get to musollah, take the cargo lift to the 4th floor, turn left. There is a pair of slippers to be used for ablution at the toilet used for the kids play water area.",
   "E": 1.429576,
   "F": 103.836173
 },
 {
   "A": "NTUC INCOME BUILDING",
   "B": "Tampines Central, S529483",
   "C": "- Level 8F extreme right. All amenities available. Strictly for SIA staff. For info please call Duty SRO Tel: 6507133\\n- J's wok & grill: Prayer room available for customers. Just ask staff for directions. Sejadah and telekong available.",
   "E": 1.352715,
   "F": 103.942496
 },
 {
   "A": "NTUC TRADE UNION HOUSE",
   "B": "Bras Basah Rd, S189556",
   "C": "- Musollah is located on the 5th level of the building (small room with signage displayed) opposite room 5C. Prayer mats and telekong provided.",
   "E": 1.296784,
   "F": 103.851402
 },
 {
   "A": "OCBC CENTRE",
   "B": "Chulia Street, S049513",
   "C": "- Nearest mosque is Masjid Moulana Mohammad Ali (Raffles Place, S048624), about 5 minutes walk.",
   "E": 1.285196,
   "F": 103.849155
 },
 {
   "A": "OCEAN BUILDING",
   "B": "Collyer Quay, S049315",
   "C": "- B1 and B2 carpark. \\nFor exact location please ask Security guard at Ocean Building ground floor",
   "E": 1.28316,
   "F": 103.851914
 },
 {
   "A": "ORCHARD HOTEL, Arcade Shopping Centre",
   "B": "Orchard Road, S238879",
   "C": "– Basement 3 carpark.  Take the lift from the Orchard Hotel to basement 2.  Turn right and follow the ramp towards basement 3.  Next to it, there is a prayer place.  Ablution place outside the room non-conditioned and ablution can be done just outside the room. There is a curtain that divides the muslimins and muslimahs. As for the telekong, it's best to bring your own but it is available there also. For assistance, you may ask the hotel staff .",
   "E": 1.307765,
   "F": 103.828459
 },
 {
   "A": "OUB CENTRE",
   "B": "Raffles Place, S048616",
   "C": "- Nearest mosque is Masjid Moulana Mohammad Ali (Raffles Place, S048624), about 5 minutes walk.",
   "E": 1.284381,
   "F": 103.850971
 },
 {
   "A": "PARKWAY EAST HOSPITAL",
   "B": "Joo Chiat Place, S427990",
   "C": "– Surau is on Level 2.  Located at end of corridor by the ICU ward.",
   "E": 1.315282,
   "F": 103.90899
 },
 {
   "A": "PASIR RIS SPORTS AND RECREATION CENTRE",
   "B": "Pasir Ris Central, S519640",
   "C": "- Surau is located on the ground floor, beside the service lift near to the Loading/Unloading Bay.\\nShared solat area for Muslimin & Muslimah.\\nSejadah and telekung provided.",
   "E": 1.374528,
   "F": 103.951943
 },
 {
   "A": "PENINSULA SHOPPING CENTRE ",
   "B": "Coleman Street, S179805",
   "C": "– Basement 1.  Enter from opposite Fire Station and go down the escalator.  Proceed straight and turn right and turn right again and look for the “Exit” door located near to the toilets.  Prayer place is beside Staircase 1 and prayer mats are on a built-in cabinet on top of letter box.  Slippers are provided and for ablution, go to the toilet nearby or washing basin/area beside the toilet.",
   "E": 1.293462,
   "F": 103.850348
 },
 {
   "A": "PLAZA SINGAPURA",
   "B": "Orchard Road, S238839",
   "C": "- Musollah at Plaza Singapura new wing. Level 4 staircase landing, in front of Le Coq Sportif store with no kiblat sign. There is another musollah located at the smoking stairs lobby near to one market which has kiblat signs. Need to bring mats and telekung.",
   "E": 1.300745,
   "F": 103.845286
 },
 {
   "A": "QUEENSWAY SHOPPING CENTRE",
   "B": "Alexandra Road, S149053",
   "C": "– Level 2.  Walk towards the toilet and cargo lift number 3.  Enter the exit door (Staircase D).  Turn right and proceed to the end.  Ablution place inside.",
   "E": 1.287671,
   "F": 103.80359
 },
 {
   "A": "QUEENSWAY SHOPPING CENTRE",
   "B": "Alexandra Road, S149053",
   "C": "– Musollah is located on Level 2 behind #02-33.  Near to the toilet and cargo lift number 3.  Enter the exit door (Staircase D).  Turn right and proceed to the end.  Ablution place inside.",
   "E": 1.287671,
   "F": 103.80359
 },
 {
   "A": "RAFFLES CITY SHOPPING CENTRE",
   "B": "North Bridge Road, S179103",
   "C": "- To get to the musollah, find Warehouse, a women’s clothing store, on the 2nd floor of the mall – it’s in front of one of the escalators. Walk down the hallway between Warehouse and G2000. Signs above the doors denote which gender their rooms are allocated to.\\nNearby malls and shops: CityLink Mall, Peninsula Plaza, Peninsula Shopping Centre, Funan DigitaLife Mall, Chijmes, Raffles Hotel Arcade.",
   "E": 1.294232,
   "F": 103.853414
 },
 {
   "A": "RAFFLES HOSPITAL",
   "B": "North Bridge Road, S188770",
   "C": "- Take lift to level 9, you will see ward 9 upon exiting. Walk down the to Room 907 (Surau). Toilet, sejadah, telekung are available in the room. Please note that the surau is now locked and is only open to patients and their families.",
   "E": 1.30183,
   "F": 103.857315
 },
 {
   "A": "RAYZ BISTRO",
   "B": "100 Selegie Road, S188308",
   "C": "- The prayer room is located on the 3rd floor and prayer mats and telekung are provided. Ablution room is mixed and public is welcome according to information that we received until further notice from Rayz Bistro itself.",
   "E": 1.302501,
   "F": 103.850147
 },
 {
   "A": "REGIONAL LANGUAGE CENTRE, RELC Building",
   "B": "Orange Groove Road, S258352",
   "C": "– Level 11, in front of the lift.  Both the lifts in RELC are side by side.  Look for a sign that states “PRAYER ROOM”.  Ablution place and telekong available.",
   "E": 1.312904,
   "F": 103.826093
 },
 {
   "A": "RENDEZVOUS HOTEL",
   "B": "Bras Basah Road, S189559",
   "C": "– Basement 1 carpark.  From outside, after seeing Turkish Kitchen, go in by the entrance.  Walk straight to the left for the lift to basement 1.  Walk straight ahead, will find a tap that is located opposite 2 doors.   Beside it, there is a label indication prayer room.  For ablution, use the tap.",
   "E": 1.299021,
   "F": 103.849129
 },
 {
   "A": "REPUBLIC PLAZA",
   "B": " Raffles Place, S048619",
   "C": "- A prayer corner is located at car park level 2, just beside “Reserved Parking“.",
   "E": 1.283194,
   "F": 103.850897
 },
 {
   "A": "REVENUE HOUSE, IRAS",
   "B": "Newton Road, S307987",
   "C": "– Nearest mosque is Masjid Abdul Hamid (Kampong Pasiran), 10 Gentle Road, S309194, about 10 minutes walk.",
   "E": 1.319771,
   "F": 103.842087
 },
 {
   "A": "ROBINSON POINT BUILDING",
   "B": "Robinson Rd, S068911",
   "C": "- 5th Floor (Car Park).\\nThere are separate rooms for male and female musollah. There are telekong and sejadah and it is very convenient for wudhu also.",
   "E": 1.279909,
   "F": 103.849454
 },
 {
   "A": "ROYAL PLAZA ON SCOTTS",
   "B": "Scotts Road, S228220",
   "C": "– At ground level, proceed to the reception area and turn right and look for the exit door that states “To Surau and Carpark”.  Enter the door and go up the staircase. You will see a room on left which states “Surau/Prayer Room”. The ablution place is inside.",
   "E": 1.307497,
   "F": 103.83254
 },
 {
   "A": "SAKURA INTERNATIONAL BUFFET @ CLEMENTI WOODS",
   "B": "Clementi Road, S129781",
   "C": "- Musollah is for customers. praying mats, telekung and even chairs are made available.",
   "E": 1.300369,
   "F": 103.768315
 },
 {
   "A": "SAKURA INTERNATIONAL BUFFET RESTAURANT, YIO CHU KANG",
   "B": "Ang Mo Kio Avenue 9, S569777",
   "C": "-There is a small room marked Surau\" with separate room for male and female at the back of restaurant. Sejadah and telekung are available. For ablution",
   "E": 1.383819,
   "F": 103.846442
 },
 {
   "A": "SAKURA RESTAURANT, ADMIRALTY PARK",
   "B": "Riverside Road, S739087",
   "C": "– There is a small office space at a corner for prayer. For directions, inquire from Muslim staff. For ablution, go to the toilet nearby. Only sejadah provided.",
   "E": 1.443903,
   "F": 103.781153
 },
 {
   "A": "SENTOSA ISLAND",
   "B": "S099981",
   "C": "– Located at the Ranger Station which is nearby Amara Sanctuary Resort and Tourism Academy.  It is just along the road towards the Beach Station.  Ask the Ranger on duty to direct the way to the praying room.",
   "E": 1.256491,
   "F": 103.822934
 },
 {
   "A": "SENTOSA ISLAND, BEACH STATION",
   "B": "S099981",
   "C": "– Basement 1, Beach Station yellow zone carpark.  Take the escalator opposite the information counter to the basement carpark.  Turn right and  there is a separate room for males and females with a sign stating “Prayer Room”.  Ablution can be taken at the nearby  water point just to the right of the musollah.",
   "E": 1.251971,
   "F": 103.81854
 },
 {
   "A": "SERANGOON JUNIOR COLLEGE",
   "B": "Upper Serangoon Road, S534768",
   "C": "- 3rd level staircase landing, behind one of the older Lecture Theaters. Ablution facilities, level 1 toilet beside the bookshop, use the fire hosereel.",
   "E": 1.365387,
   "F": 103.886996
 },
 {
   "A": "SERANGOON JUNIOR COLLEGE",
   "B": "Upper Serangoon Road, S534768",
   "C": "- 3rd level staircase landing, behind one of the older Lecture Theaters. Ablution facilities, level 1 toilet beside the bookshop, use the fire hosereel.",
   "E": 1.365387,
   "F": 103.886996
 },
 {
   "A": "SHAW TOWERS",
   "B": "Beach Rd, S189702",
   "C": "- Level 12 staircase, please bring your own sejadah and telekong to pray.",
   "E": 1.29694,
   "F": 103.857037
 },
 {
   "A": "SHERATON TOWERS SINGAPORE HOTEL",
   "B": "Scotts Road, S228230",
   "C": "- Basement 4, carpark.  Take the carpark lift from lobby.  There are 2 prayer rooms for males and females located beside the washroom.  Slippers and telekong are available.",
   "E": 1.312135,
   "F": 103.836476
 },
 {
   "A": "SILAT CENTRE OF EXCELLENCE",
   "B": "Bedok North Street 2, S469646",
   "C": "-  Musollah available for those visiting Bedok Stadium, Bedok Swimming Pool Complex or its vicinity.",
   "E": 1.325783,
   "F": 103.937867
 },
 {
   "A": "SIMPANG BEDOK",
   "B": "Bedok Rd, S469445",
   "C": "- Musollah is located in between Spize and Enak Restaurant. Walk to staircase leading to the second floor, the musollah is located there. Prayer mat and small wudhu area provided.",
   "E": 1.331099,
   "F": 103.948392
 },
 {
   "A": "SINGAPORE AIRLINES - MSD, Management Services Division Building",
   "B": "Upper Changi Road East, S486852",
   "C": "- Ground level.  After security, turn right to the end.  Near female toilet.  Staggered time for male and female and check with security.",
   "E": 1.344893,
   "F": 103.964646
 },
 {
   "A": "SINGAPORE AIRLINES - STC, Singapore Training Centre Building",
   "B": "Upper Changi Road East, S486852",
   "C": "- Level 5-05c.  For male and female.  Ablution place available.",
   "E": 1.344893,
   "F": 103.964646
 },
 {
   "A": "SINGAPORE AIRLINES, Airline House",
   "B": "Airline Road, S819829",
   "C": "– For male – Core 3D and 5E (opposite staff travel).  \\nFor female – Core 5C and 6E.  Ablution place available.",
   "E": 1.376813,
   "F": 103.995716
 },
 {
   "A": "SINGAPORE CONFERENCE HALL",
   "B": "Shenton Way, S068810",
   "C": "– Nearest mosque is Masjid Haji Muhammed Salleh (Palmer Road, S079424), about 10 minutes walk.",
   "E": 1.276635,
   "F": 103.848919
 },
 {
   "A": "SINGAPORE DISCOVERY CENTRE",
   "B": "Upper Jurong Road, S638365",
   "C": "– Look for a muslim staff at the counter and ask for the key to the prayer room. The staff will lead you to Level 1, First Aid Room where the prayer room is. Prayer mat and telekung is provided.",
   "E": 1.332937,
   "F": 103.678932
 },
 {
   "A": "SINGAPORE EXPO",
   "B": "Expo Drive, S486150",
   "C": "– Musollah is located on Level 2.  At the end of Hall 6.  There is a partitioned room for men and women.  For ablution, go to the toilet nearby.",
   "E": 1.333815,
   "F": 103.959483
 },
 {
   "A": "SINGAPORE FLYER",
   "B": "Raffles Ave, S039803",
   "C": "- The musollah is located at West Promenade Level 1 (opposite DBS ATM/AXS machines). For assistance in utilising the Prayer Room, please approach our friendly staff at the Guest Services Lounge on Level 1.",
   "E": 1.289873,
   "F": 103.863238
 },
 {
   "A": "SINGAPORE GENERAL HOSPITAL",
   "B": "Hospital Drive, S169608",
   "C": "– Behind Housemen’s Canteen and very near to public car park G.  Look for a small building that states “Surau”.",
   "E": 1.280241,
   "F": 103.834841
 },
 {
   "A": "SINGAPORE GENERAL HOSPITAL",
   "B": "Hospital Drive, S169608",
   "C": "– Behind Housemen’s Canteen and very near to public car park G.  Look for a small building that states “Surau”.",
   "E": 1.280241,
   "F": 103.834841
 },
 {
   "A": "SINGAPORE INSTITUTE OF MANAGEMENT, SIM",
   "B": "Clementi Road, S599490",
   "C": "– Musollah is located below staircase 24 in block A, beside Lecture Room 1.10.  Slipper provided and for ablution go to the toilet nearby.",
   "E": 1.329801,
   "F": 103.776275
 },
 {
   "A": "SINGAPORE INSTITUTE OF MANAGEMENT, SIM",
   "B": "Clementi Road, S599490",
   "C": "– Located below staircase 24, beside Lecture Room 1.10.  Slippers are provided and for ablution, go to a nearby toilet .",
   "E": 1.329801,
   "F": 103.776275
 },
 {
   "A": "SINGAPORE INSTITUTE OF MANAGEMENT, University of Buffalo",
   "B": "Namly Avenue, S267616",
   "C": "- Main building where the auditoriums are situated. There is a door next to the ladies toilet which will lead to a small space, used for prayers. Toilets can be found beside the auditorium (the upper floor auditoriums). No sejadah or telekong.",
   "E": 1.326253,
   "F": 103.799939
 },
 {
   "A": "SINGAPORE MANAGEMENT UNIVERSITY, SMU",
   "B": "Victoria Street, S188065",
   "C": "-  SMU T-junction (underground area just outside Bras Basah MRT Station Exit B or C), walk through a corridor just beside OCBC Frank and the stairs. Walk pass the Mrs Wong Kwok Leong Student Wellness Centre and the Cosy Haven. At the end of the corridor, you will see the entrance of the musollah on your left. Prayer mats and telekong provided. Ablution can be done at the nearby toilets. (Student/Staff matric card is required for access)",
   "E": 1.297139,
   "F": 103.852181
 },
 {
   "A": "SINGAPORE SAFETY DRIVING CENTRE, SSDC",
   "B": "Woodlands Industrial Park E4, S757387",
   "C": "- Turn to the left of the Traffic Police counter. Enter the door leading to stairs 1. The prayer place is below the stairs. Prayers mats and qiblat direction is provided. Wudhu can be taken at the nearby toilets.",
   "E": 1.45201,
   "F": 103.793987
 },
 {
   "A": "SINGAPORE SCIENCE CENTRE",
   "B": "Science Centre Road, S609081",
   "C": "–Ask for the key to the musollah from the staff at the counter. The staff shall lead you to Level 1, First Aid Room. Prayer mat & prayer outfit (telekung) for ladies included.",
   "E": 1.333687,
   "F": 103.7358
 },
 {
   "A": "SINGAPORE UNIVERSITY OF TECHNOLOGY & DESIGN - SUTD",
   "B": "8 Somapah Rd, 487372",
   "C": "- Musollah is located at SUTD blk 2 basement 1. The room is shared for both males and females. The room is divided by a curtain. The right side, belong to females and left for males. Wudhu can be taken at toilets at level 1-7",
   "E": 1.340407,
   "F": 103.963013
 },
 {
   "A": "SINGAPORE ZOO",
   "B": "Mandai Lake Road, S729826",
   "C": "– First Aid station. Located at the extreme end of the coach park, near to the Zoo ticketing counter. Request permission first from the staff to use the room.",
   "E": 1.404692,
   "F": 103.792969
 },
 {
   "A": "SLF BUILDING",
   "B": "510 Thomson Rd, S298135",
   "C": "​- Prayer corner available at SLF Building. It is located at the carpark. Prayer mat provided, bring your own telekong and sejadah. Wudhu can be taken at a nearby toilet.",
   "E": 1.33381,
   "F": 103.839395
 },
 {
   "A": "SOUTHPOINT",
   "B": "Cantonment Road, S089763",
   "C": "– Basement 1, car park.  Ablution place available and toilet on basement 2.",
   "E": 1.273807,
   "F": 103.841192
 },
 {
   "A": "SWISSOTEL THE STAMFORD",
   "B": "Stamford Road, S178882",
   "C": "-  Level 2.  Enter main lobby and proceed to the right side escalator and go up to level 2 and turn to the right. There are 2 small male and female musollahs which are separated.  For ablution, go to the toilet nearby.",
   "E": 1.293686,
   "F": 103.853506
 },
 {
   "A": "T BOB'S CORNER",
   "B": "Bedok North St 3, S460527",
   "C": "- Prayer space and wudhu facilities available upstairs for patrons. Please ask staff for assistance.",
   "E": 1.334407,
   "F": 103.928446
 },
 {
   "A": "TAKASHIMAYA SHOPPING CENTRE",
   "B": "Orchard Road, S238873",
   "C": "- Basement 1.  Proceed towards the public toilet and staff reporting entrance and go straight to the washing bay after the toilet.  There is a small room that states “Store” for prayer.  Ablution place outside the room.  Telekong and slippers are available.",
   "E": 1.302468,
   "F": 103.835122
 },
 {
   "A": "TAMPINES MALL",
   "B": "Tampines Central 5, S529510",
   "C": "– Musollah, is located on level 3 corridor near to the toilet.  Go towards the toilet, turn right upon seeing the corridor.  Telekong and slippers are available. Ablution can be done at the nearby toilet.",
   "E": 1.3541,
   "F": 103.944952
 },
 {
   "A": "TECHLINK",
   "B": "Kaki Bukit Road 3, S417818",
   "C": "– Lobby A, level 3.  On the right side of the entrance of Federal Express Office.  Ablution area at cleaner’s room, on the right of passageway leading to the toilet.  Room shared by males and females.  Telekong available.",
   "E": 1.335683,
   "F": 103.905367
 },
 {
   "A": "TEMASEK POLYTECHNIC",
   "B": "Tampines Avenue 1, S529757",
   "C": "- Level 5 of New Design Block (Blk 28A)\\n- Applied Science Blk 7 Level 8\\n- Applied Science Blk 7 Level 7\\n- Humanities and Social Science Blk Level 5\\n- IT Blk 3 Level 8\\n- IT Blk 3 Level 6\\n- Engine Blk 22 Level 6\\n- Engine Blk 15 Level 7 \\n- Business School Level 06-15/1\\n- Squash Court Gallery (Sports Complex)",
   "E": 1.345651,
   "F": 103.932847
 },
 {
   "A": "THE STAR VISTA",
   "B": "Vista Exchange Green, S138617",
   "C": "- Please note that this is an unofficial prayer corner. Look for  the prayer corner is located on level 1, near to shop Swee Lee and SOL, near the lift exit. The alleyway is near the multiple ATMs on the top of the escalator. There are 2 prayer mats, sejadah and cardboard boxes there for use.",
   "E": 1.306828,
   "F": 103.788467
 },
 {
   "A": "THE TRIPLE ONE",
   "B": "Somerset Rd, S238164",
   "C": "- B1 Carpark",
   "E": 1.300144,
   "F": 103.837444
 },
 {
   "A": "THOMSON MEDICAL CENTRE",
   "B": "Thomson Road, S307677",
   "C": "- Level 6.  Exit lift, turn right and proceed to the end.  Enter an Exit door that stated “Lift & Toilet”.  Proceed straight and turn left and there is a small room for prayer stated “Prayer Room”.  Male and female cubicle provided and slipper and  telekong available.  Ablution place at handicap toilet nearby.",
   "E": 1.325297,
   "F": 103.84149
 },
 {
   "A": "TUAS SOUTH RECREATION CENTRE",
   "B": "12 Tuas Ave 13, Singapore 639035",
   "C": "- This place is only available for Friday prayers. The Friday prayers is led by an Imam from MUIS, and is mainly for the foreign worker community in Tuas. The sermon will be in English.",
   "E": 1.269797,
   "F": 103.634236
 },
 {
   "A": "UE BIZHUB EAST BESIDE CHANGI CITY POINT",
   "B": "Changi Business Park Avenue 1, S486018",
   "C": "- The prayer room is located somewhere near to the NTUC & the toilet lift lobby.",
   "E": 1.335258,
   "F": 103.963896
 },
 {
   "A": "UNITED SQUARE",
   "B": "Thomson Road, S307591",
   "C": "– Level 5A, car park next to ramp to level 6.  For ablution, toilet at levels 5A car park.\\n- Musollah is on Level 4, staircase next to the toilet near Phillip Wain.",
   "E": 1.317169,
   "F": 103.8436
 },
 {
   "A": "UNIVERSAL STUDIOS SINGAPORE",
   "B": "Artillery Avenue, Sentosa, S099958",
   "C": "- Located just beside Battlestar Galactica, there is a green lamp post as an indicator for the prayer room. Turn right and follow the path. You will see a small building after the lockers section.  There is a small room for prayer which states “Prayer Room” with ablution facility provided. There is only 1 telekung available so preferably, bring your own. For help, approach the information counter near to the entrance.",
   "E": 1.25406,
   "F": 103.823849
 },
 {
   "A": "UOB PLAZA 1 AND 2",
   "B": "Raffles Place, S048624",
   "C": "- Nearest mosque is Masjid Moulana Mohammad Ali (Raffles Place, S048624), about 5 minutes walk.",
   "E": 1.285452,
   "F": 103.850183
 },
 {
   "A": "VIVOCITY",
   "B": "Harbourfront Walk, S098585",
   "C": "– Nearest mosque is Masjid Temenggong Daeng Ibrahim (Telok Blangah Road), about 10 minutes walk.\\nAlternative site: There is a clean private spot (unofficial) at the 3rd Level between Daiso and Pet Safari. It is located at the end of the corridor that leads to the toilets and lift lobby G.\\nWalk right to the end and turn left. There is a private spot that can accommodate 2-3 persons. Please bring your own sejadah and telekung.\n",
   "E": 1.264249,
   "F": 103.822349
 },
 {
   "A": "WATERWAY POINT",
   "B": "83 Punggol Central, S828761",
   "C": "- No official prayer room available but this is a possible place to consider for solat. Bring your own prayer mat, sejadah and telekong. Wudhu can be taken at the nearby toilet.",
   "E": 1.406114,
   "F": 103.901879
 },
 {
   "A": "WHITESANDS",
   "B": "1 Pasir Ris Central, S519599",
   "C": "- Prayer area is on level 5 beside the Standford Learning Centre. Wudhu can be taken at the nearby toilet.",
   "E": 1.37247,
   "F": 103.94965
 },
 {
   "A": "WISMA ATRIA SHOPPING CENTRE",
   "B": "Orchard Road, S238877",
   "C": "– Musollah is on Level 7, staircase area.  Use cargo lift (Service Lift 9) near to Isetan and public toilet to level 7 carpark.  Once outside the lift, turn left and proceed straight to the end of carpark.  Take the pathway on the right and it will lead to a “Fire Exit/Staircase 2” door.  Open the door and you will see the staircase area converted to musollah.  Sejadah and telekong are available.  There is a small white ceramic basin with tap outside the door for ablution.",
   "E": 1.303916,
   "F": 103.833052
 },
 {
   "A": "WOODLANDS CIVIC CENTRE",
   "B": "S Woodlands Dr, S730900",
   "C": "- At civic centre level 1, there is a prayer room near the entrance. Turn left at the staircase. Ladies level 1 and men 2. Telekung and sejadah is provided.",
   "E": 1.434576,
   "F": 103.786614
 },
 {
   "A": "WOODLANDS REGIONAL LIBRARY",
   "B": "Woodlands Civic Centre, South Woodlands Drive, S730900",
   "C": "– Level 1. Before entering the main entrance, enter door (Stair 2) on the left that leads to the staircase and go straight. Prayer space is located at the extreme end. When praying in a bigger congregation, proceed to the staircase and go up to level 2 in the same area. A replica of a sajadah with foot-marks and qiblat infront of it is there to indicate the prayer place. Sejadah is no longer provided. For ablution, go to the toilet nearby.",
   "E": 1.434947,
   "F": 103.786971
 }
]